src/ex_Tabakon/Enums/ВидыУпаковокИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВидыУпаковокИС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Потребительская</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Групповая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/ex_Tabakon/Enums/ТипыШтрихкодов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыШтрихкодов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>EAN8</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>EAN13</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>DataMatrix</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/ex_Tabakon/CommonModules/ШтрихкодированиеИССлужебный/Ext/Module.bsl
&Вместо("РазобратьКодМаркировки")
Функция ТБКРазобратьКодМаркировки(Знач ДанныеДляРазбора, ВидыПродукции, ПримечаниеКРезультатуРазбора)
	// Вставить содержимое метода.
	Результат = ПродолжитьВызов(ДанныеДляРазбора, ВидыПродукции, ПримечаниеКРезультатуРазбора);
	
	//Костыль для воды 2023-06-15
	Если Результат = Неопределено и (СтрДлина(ДанныеДляРазбора) = 37 или СтрДлина(ДанныеДляРазбора) = 31) тогда
		Результат = Новый Структура;
		Результат.Вставить("ВидУпаковки", Перечисления.ВидыУпаковокИС.Потребительская);
		Результат.Вставить("КодМаркировки", ДанныеДляРазбора);
		Результат.Вставить("НормализованныйКодМаркировки", ДанныеДляРазбора);
		Результат.Вставить("ТипШтрихкода",Перечисления.ТипыШтрихкодов.DataMatrix);
		
		СоставКодаМаркировки	=	Новый Структура;
		СоставКодаМаркировки.Вставить("EAN", Сред(ДанныеДляРазбора,4,13));
		СоставКодаМаркировки.Вставить("GTIN", "010"+СоставКодаМаркировки.EAN);
		СоставКодаМаркировки.Вставить("МРЦ", "0");
		СоставКодаМаркировки.Вставить("МРЦСтрокой", Сред(ДанныеДляРазбора,30,2));
		СоставКодаМаркировки.Вставить("СерийныйНомер", Сред(ДанныеДляРазбора,17,13));
		
		Результат.Вставить("СоставКодаМаркировки",СоставКодаМаркировки);

	КонецЕсли;
	
	//Костыль для мак баррен 2024-06-06
	Если Результат = Неопределено и ( СтрДлина(ДанныеДляРазбора) = 32 или  СтрДлина(ДанныеДляРазбора) = 33) тогда
		Результат = Новый Структура;
		Результат.Вставить("ВидУпаковки", Перечисления.ВидыУпаковокИС.Потребительская);
		Результат.Вставить("КодМаркировки", ДанныеДляРазбора);
		Результат.Вставить("НормализованныйКодМаркировки", ДанныеДляРазбора);
		Результат.Вставить("ТипШтрихкода",Перечисления.ТипыШтрихкодов.DataMatrix);
		
		СоставКодаМаркировки	=	Новый Структура;
		СоставКодаМаркировки.Вставить("EAN", Сред(ДанныеДляРазбора,4,13));
		СоставКодаМаркировки.Вставить("GTIN", "010"+СоставКодаМаркировки.EAN);
		СоставКодаМаркировки.Вставить("МРЦ", "0");
		СоставКодаМаркировки.Вставить("МРЦСтрокой", "AAAA");
		СоставКодаМаркировки.Вставить("СерийныйНомер", Сред(ДанныеДляРазбора,17,13));
		
		Результат.Вставить("СоставКодаМаркировки",СоставКодаМаркировки);

	КонецЕсли;

	
	
	
	Возврат Результат;
КонецФункции
